/*
Достойная оплата труда
Используя цикл вывести на экран сто раз надпись:
"Я никогда не буду работать за копейки. Амиго"
Каждое значение вывести с новой строки.


Требования:
1. Программа не должна считывать текст c клавиатуры.
2. Программа должна выводить текст на экран.
3. Программа должна выводить 100 раз текст указанный в задании.
4. В программе должен использоваться цикл for или цикл while.
*/
package javaSyntax.level4;

public class task86_lev4_lec16 {
    public static void main(String[] args) {
        for(int x = 0; x < 100; x++){
            System.out.println("Я никогда не буду работать за копейки. Амиго");
        }
    }
}
